Команда git add
добавляет содержимое рабочего каталога  
в индекс (staging area) для последующего коммита. Эта команда дается после добавления
файлов. Писать название целиком не обязательно: терминал дозаполнит данные автоматически.

Команда git commit
зафиксировать или сохранить

Команда git log 
Журнал изменений
Перед переключением версии файла в Git
используйте команду git log, чтобы увидеть
количество сохранений

Команда git checkout
Переключение между версиями.
Для работы нужно указать не только
интересующий вас коммит, но и вернуться  
в тот, где работаем, при помощи команды  
git checkout master.

Команда git diff
Показывает разницу между текущим файлом
и сохранённым
Перед переключением версии файла в Git
используйте команду git log, чтобы увидеть
количество сохранений

Синтаксис языка Markdown.
 текст — *
 Курсивный текст — *
 Зачеркнутый текст — ~
 Выделяют заголовки — # в начале строки
Показать уровень заголовка —
подчеркивание знаками = или ****
Нумерованные Списки — обозначаются
обычными цифрами 1, 2, 3
 Ненумерованные Списки — обозначаются
*знаками в начале строки
 Вложенные Списки — выполняем отступы
